trade/src/InformationRegisters/ИсполнениеАкций/ИсполнениеАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнениеАкций</name>
  <resources>
    <name>КлиентаПривел</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАкции</name>
    <type>
      <types>EnumRef.ВидыАкций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Алгоритм</name>
    <type>
      <types>EnumRef.АлгоритмыАкций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>CatalogRef.ДействияАкций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/ИсполнениеАкций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ЗаписатьИсполнениеАкции(Документ, Акция, Действие, КлиентаПривел = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей= РегистрыСведений.ИсполнениеАкций.СоздатьНаборЗаписей();
	Запись= НаборЗаписей.Добавить();
	Запись.Дата= ТекущаяДата();
	Запись.Документ= Документ;
	Запись.ВидАкции= Акция.ВидАкции;
	Запись.Алгоритм = Акция.Алгоритм;
    Запись.Клиент = Документ.Партнер;
    Запись.Документ = Документ;
    Запись.Действие = Действие;
	
	НаборЗаписей.Записать(Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
#КонецЕсли
